export default {
  appName: 'FF24++',
  aboutUs: 'про нас',
  about: {
    subtitle: `Ми - команда веб-розробників, які створили цей веб-сайт, щоб допомогти людям спростити процес
      обчислення податку з Freedom Finance 24 для подачі щорічної декларації.`,
    subtitle2: `Завдяки нашому досвіду в веб-технологіях, ми змогли розробити простий та зручний інструмент,
      який дозволяє користувачам легко та точно розраховувати свій податок.`,
    subtitle3: `Ми вважаємо, що кожен повинен мати доступ до інструментів, які спрощують складні процеси,
      такі як обчислення податку, і сподіваємося, що наш веб-сайт позитивно вплине на ваше життя`,
    subtitle4: `Якщо у вас є будь-які питання або зауваження, будь ласка, не соромтеся зв'язатися з нами.
      Ми будемо раді почути від вас!`,
    sendEmail: 'Надіслати листа',
  },
  calculation: {
    header: 'Обрахунок податків',
    fileLabel: 'Завантажуй звіт сюди',
    submit: 'Обрахувати',
    total: 'Сумарний дохід ({currency})',
    gainTax: 'Податок на дохід (18%)',
    militaryTax: 'Військовий збір (1.5%)',
    period: 'Період',
    uah: 'грн',
    usd: 'usd',
    error: 'Помилка',
    table: {
      name: 'Деталі обрахунку',
      date: 'Дата',
      exchangeRate: 'Курс обміну',
      profit: 'Дохід в {currency}',
      moreInfo: 'Детальніше',
    },
    instruction: {
      mobileTab: 'Інструкція для телефону',
      desktopTab: 'Інструкція для ПК',
      mobile: {
        header: 'Як отримати брокерський звіт з телефону',
        step1: 'Відкрийте додаток Freedom24',
        step2: 'Увійдіть в свій обліковий запис',
        step3:
          'Виберіть "Накопичувальний рахунок": Перейдіть в меню, "Вибір рахунку" та виберіть "Накопичувальний рахунок"',
        step4: 'Перейдіть в меню та виберіть "Звіти брокера"',
        step5:
          // eslint-disable-next-line max-len
          'Виберіть період, від початку до кінця року (наприклад 31/12/2022 - 31/12/2023), найкраще вибрати початковий день, як останній день минулого року, як в прикладі',
        step6: 'Клікніть на кнопку надіслати звіт на email',
        step7: 'Змініть формат на JSON з PDF',
        step8: 'Надішліть звіт на пошту',
        step9: 'Вставте звіт з пошти в поле нижче',
      },
      desktop: {
        header: 'Як отримати брокерський звіт з ПК',
        step1: 'Відкрийте сайт freedom finance 24: https://freedom24.com/',
        step2: 'Увійдіть в свій обліковий запис',
        step3: 'Виберіть "Накопичувальний рахунок"',
        step4: 'Виберіть "Кабінет" у верхній частині сторінки',
        step5: 'Виберіть "Звіти брокера"',
        step6:
          // eslint-disable-next-line max-len
          'Виберіть період, від початку до кінця року (наприклад 31/12/2022 - 31/12/2023), найкраще вибрати початковий день, як останній день минулого року, як в прикладі',
        step7: 'Клікніть справа на кнопку налаштувань',
        step8: 'Змініть формат на JSON з PDF',
        step9: 'Надішліть звіт на пошту',
        step10: 'Вставте звіт з пошти в поле нижче',
      },
    },
  },
  headerMenu: {
    calculation: 'обрахунок',
    dark: 'ніч',
    light: 'день',
  },
  validation: {
    required: "Файл обов'язковий",
    invalidFormat: 'Файл з неправильним розширенням',
    fileEmpty: 'Файл пустий',
    fileContain: 'У файлі погані дані',
    siteUnavailable: 'Неможливо отримати дані з НБУ. Спробуйте пізніше',
    invalidExchangeRate: 'На певний день курс обміну не знайдено',
  },
};
